
#include <iostream>
using namespace std;
/*
 Дано двузначное число. Вывести вначале его левую цифру (десятки),
 а затем — его правую цифру (единицы). Для нахождения десятков исполь-
 зовать операцию деления нацело, для нахождения единиц — операцию
 взятия остатка от деления.
 */
int main() {
    int num;
    cout<<"Введите двузначное число: ";
    cin>>num;
    if(num>10 && num<99){
        int tens = num / 10;
        int ones = num % 10;
        cout<<"В вашем числе "<<tens<<" десятков и "<<ones<<" единиц"<<endl;
    }
    else if (num > -99 && num < -9){
        int tens = (-num) / 10;
        int ones = (-num) % 10;
        cout<<"В вашем числе "<<tens<<" десятков и "<<ones<<" единиц"<<endl;
    }
    else{
        cout<<"Введите двузначное число!"<<endl;
    }
    
    return 0;
}
